numbers = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
ten = ["десять ", "одиннадцать ", "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестнадцать ", "семнадцать ", "восемнадцать ", "девятнадцать "]
tens = ["", "десять ", "двадцать ", "тридцать ", "сорок ", "пятьдесят ", "шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто "]
hundreds = ["", "сто ", "двести ", "триста ", "четыреста ", "пятьсот ", "шестьсот ", "семьсот ", "восемьсот ", "девятьсот "]
words = ""
N = int(input())
while N > 999 or N < 1:
    N = int(input("rty agan "))
h = N // 100
if h > 0:
    words += hundreds[h]
t = (N-h*100)//10
if t == 1:
    ts = (N-h*100-t*10)
    if ts > 0:
        words += ten[ts]
elif t > 1:
    words += tens[t]
elif t == 0:
    n = (N-h*100-t*10)
    words += numbers[n]
print(words)
